2016年9月19日
修复设置界面的检测项目下载报错问题、且将保存检测项目的代码迁移到设置界面；

2016年10月14日
  - 修复admin账号登录编辑或新增用户后，返回用户管理界面在没有选择用户的情况下点击编辑或删除不提示“请选择用户”的bug；
  - 分光、胶体金、干化学 项目编辑界面的【返回】按钮，修复提示保存成功后不自动关闭的bug；
  - 优化被检单位和样品编辑界面的关闭事件；
  - 禁止登陆界面和用户编辑界面的用户名和密码框中文输入；
  - 报表界面的查询按钮放在查询条件后面；
  - 修改被检单位查询小窗口输入不存在的查询条件时，列表没有清空的bug；
  - 修复样品小精灵入口新增样品的title显示错误；
  - 修复检测界面的打印功能打印没有按照顺序的bug，现在按照ID逆序打印；
  - 修改项目里的“任务编号”应改为“任务主题”；
  - 修复胶体金项目编辑后，点击返回提示“是否保存项目编辑”，选是后又提示“是否保存当前内容”，应把第一个提示去掉（没修改也提示）；
  - 干化学项目 单位选项没有设为必填项；
  - 打印格式调整，新增【检测设备】等；
  - 被检单位编辑地址字体太小；
  - 修复胶体金、干化学模块检测完后编号跳号的bug；
  - 修改一体机检测结果界面打印功能（同箱仪一体机不一样）；
  - 修复胶体金、干化学检测结果和判定结果偶有不一致的bug；

  2016年10月28日
  - 需要用到互联网的功能，新增网络判断；
  - 检测模块去掉30秒上传失败提示；
  - 检测编号前缀新增32位GUID，解决数据上传唯一标识的问题；
  - 导入数据时，根据检测编号判断当前样品是否已存在，不存在导入，存在则提示不导入；

  2016年11月5日
  - 修改上传方法，某些情况下上传了数据但平台未保存，此时给予提示；

  2016年11月8日 接口类型"ZH"：东莞项目
  - 用户权限新增【验证快检单号】元素，不勾选时不验证快检单号；
  - 检测项目选择界面，取消样品名称和快检单号验证提示；
  - 如果当前选择的检测项目没有做过对照(需要对照)，选中的第一个通道不验证任何信息，且第一通道的样品名称自动默认为“对照物”；

  2016年12月19日 功能优化
  - 【数据管理】新增【食品安全法律法规】数据模块，功能包括：新增、删除/批量删除、查看、查询、恢复默认；
  - 检测数据保存功能优化：SysCode改为GUID，用于监管平台标识唯一；
  - 【检测数据查看界面】的数据上传功能优化：优化ListToDataTable()方法；

  2016年12月
  - 自动升级功能优化；
  - 检测项目选择界面不验证必填项，通道选择界面再验证；
  - 分光光度模块-标准曲线法的值根据区间来带入不同的公式计算结果；

  2017年1月13日
  - 配置文件EACHDISTRICT新增"CC"配置，value="CC"时为禅城区专用版，当前版本样品名称和被检单位为必填且无法手工录入；
  - 检测项目选择界面【开始检测】按钮新增服务器通讯测试验证，如果没有验证会弹出一个提示框；
  - 在检测结果界面上传数据方法前新增服务器通讯验证提示框，如果还未进行服务器通讯测试则提示是否立即前往验证；
